[SEACAD]
##TIP
IDC_STATIC_WWW                     =   http://www.basiliang.com
SEA_MALLOC_FAIL                    =   申請內存失敗
IDS_CHOOSE_COLOR                   =   請先選擇顏色
IDS_SAVE_PARAM_OK                  =   參數已保存
IDS_SAVE_FILE_OK                   =   數據已保存
IDS_MSG_MRAK_FLY                   =   請先停用飛行標刻

##DLG－ABOUT
DLG_ABT_CAD                        =   關於SeaCad
IDC_STATIC_VER                     =   SeaCAD 3.0.2.3.41201版
IDC_STATIC_WARN                    =   警告:版權所有 (C) 2013-2020
COMPANY_BSL                        =   長沙八思量信息技術有限公司
APP_ISRUNING                       =   本軟件已經在運行中
QUIT                               =   退出
TIP_IDOK                           =   確定
IDCANCEL                           =   取消
##菜單
IDS_MENU_FILE                      =   檔案(&F)
IDS_MENU_FILE_NEW                  =   新增(&N)
IDS_MENU_FILE_OPEN                 =   打開(&O)
MENU_FILE_SAVE                     =   儲存(&S)
MENU_FILE_SAVE_AS                  =   另存為(&A)...
MENU_FILE_PRINT                    =   列印 Ctrl+P
MENU_FILE_SCANIMAGE                =   獲取掃描圖象(&m)...
MENU_FILE_SYSTEM                   =   系統參數(&P)...
MENU_FILE_IMGLIB                   =   常用圖庫(&L)...
MENU_FILE_MRU_FILE1                =   最近檔案
IDS_MENU_FILE_CLOSE                =   關閉(&C)
IDS_MENU_FILE_EXIT                 =   退出(&E)

##
MENU_EDIT                          =   編輯(&E)
MENU_EDIT_UNDO                     =   復原(&U)
MENU_EDIT_REDO                     =   恢復(&R)
MENU_EDIT_CUT                      =   剪下(&T) Ctrl+X
MENU_EDIT_COPY                     =   複製(&C) Ctrl+C
MENU_EDIT_PASTE                    =   貼上(&P)
MENU_EDTI_ALL                      =   全選(&A) Ctrl+A
MENU_EDIT_UNALL                    =   反向選擇
MENU_EDIT_DEL                      =   刪除
MENU_EDIT_COMBINE                  =   組合     Ctrl+L
MENU_EDIT_UNCOMBINE                =   分離組合 Ctrl+K
MENU_EDIT_GROUP                    =   群組     Ctrl+G
MENU_EDIT_UNGROUP                  =   分離群組 Ctrl+U
MENU_EDIT_TOCURVE                  =   轉為曲線  Ctrl+Q
MENU_EDIT_TODASHED                 =   轉為虛線
MENU_EDIT_UNGROUPTEXT              =   分離文本
MENU_EDIT_HATCH                    =   填充      Ctrl+H


MENU_DRAW                          =   繪製(&D)
MENU_DRAW_POINT                    =   點(&P)
MENU_DRAW_CURVE                    =   曲線(&R)
MENU_DRAW_LINE                     =   直線(&L)
MENU_DRAW_RECT                     =   矩形(&R)
MENU_DRAW_CIRCLE                   =   圓(&C)
MENU_DRAW_ELLIPSE                  =   橢圓(&E)
MENU_DRAW_POLY                     =   多邊形(&G)
MENU_DRAW_TEXT                     =   文字(&T)
MENU_DRAW_PICF                     =   圖片文件(&T)
MENU_DRAW_BMPFILE                  =   位圖文件(&B)
MENU_DRAW_VECTORFILE               =   向量文件(&V)
MENU_DRAW_TIMER                    =   延時器(&M)
MENU_DRAW_INPUT                    =   輸入端口(&I)
MENU_DRAW_OUTPUT                   =   輸出端口(&O)
MENU_DRAW_ENCODERDIST              =   編碼器移動距離
MENU_DRAW_SPIRAL                   =   螺旋線


MENU_MODI                          =   修改(&M)
MENU_MODI_ARRAY                    =   陣列
MENU_MODI_TRANSFORM                =   變換
MENU_MODI_MOD                      =   造型
MENU_MODI_TRIM                     =   修剪
MENU_MODI_BKCRSPT                  =   去除交叉點
MENU_MODI_AUTOCON                  =   自動連接
MENU_MODI_RESORT                   =   排序
MENU_MODI_ALIGN                    =   對齊

MENU_ALIGN_BOTTOM                  =   底邊對齊
MENU_ALIGN_CENTER                  =   中心點對齊
MENU_ALIGN_CENTER_HOR              =   水平中線對齊
MENU_ALIGN_CENTER_VER              =   垂直中線對齊
MENU_ALIGN_LEFT                    =   左邊對齊－
MENU_ALIGN_RIGHT                   =   右邊對齊
MENU_ALIGN_TOP                     =   頂邊對齊

##
MENU_VIEW                          =   查看(&V)
MENU_VIEW_SYS                      =   系統選單欄
MENU_VIEW_WID                      =   界面窗口欄
MENU_VIEW_TOOLBAR                  =   系統工具欄(&T)
MENU_VIEW_ZOOMBAR                  =   視圖工具欄(&Z)
MENU_VIEW_DRAWBAR                  =   繪制工具欄(&D)
MENU_VIEW_ZOOM                     =   放縮工具欄
MENU_VIEW_ASS                      =   輔助工具欄
MENU_VIEW_ALL                      =   對齊工具欄
MENU_VIEW_OBJ                      =   對象列表欄
MENU_VIEW_ENTPROP                  =   對象屬性欄
MENU_VIEW_MAKPAR                   =   標刻參數欄
MENU_VIEW_LAS                      =   雷射操作欄
##
MENU_VIEW_STATUS_BAR               =   狀態欄(&S)
ENTPROP                            =   對象屬性
MENU_VIEW_RULER                    =   顯示標尺
MENU_VIEW_GRID                     =   顯示網格
MENU_VIEW_GUILD                    =   顯示輔助線
MENU_VIEW_PATH                     =   顯示路徑
MENU_VIEW_SNAPGRID                 =   捕捉網格
MENU_VIEW_SNAPGUILD                =   捕捉輔助線
MENU_VIEW_SNAPOBJECT               =   捕捉對象
MENU_VIEW_TRAK                     =   軌跡預覽
MENU_VIEW_IOSTATE                  =   IO狀態
MENU_VIES_GENCODE                  =   生成Gcode

##
MENU_SPECIAL                       =   特殊(&S)
MENU_SPE_CHGTXT                    =   改變文字
MENU_SPE_VARTXT                    =   序列號文字
MENU_SPE_SNEXTADD                  =   序列號遞增
MENU_SPE_SNEXTDEL                  =   序列號遞減
MENU_SPE_SNEXTRESET                =   序列號復位

##
MENU_LASER                         =   雷射(&L)
MENU_LAS_ANGLEROTATE               =   旋轉角度標刻
MENU_LAS_ANGLEROTATE2              =   360度旋轉角度標刻
MENU_LAS_EXTAXI                    =   擴展軸標刻
MENU_LAS_RINGMARKF5                =   戒指標刻(F5)
LASERREADYIO                       =   雷射準備好端口
##
MENU_CALIB                         =   振鏡校正(&C)
IDM_INIT_CALIB                     =   初值校正
IDM_LSM_CALIB                      =   擬合校正
##
MENU_HELP                          =   幫助(&H)
MENU_ABOUT                         =   關於SEACAD(&A)
MENU_CHA_VIEW                      =   更改外觀
MENU_OF2003                        =   Office2003銀色
MENU_OF2007                        =   Office2007銀灰
MENU_OF2007BLU                     =   Office2007藍色
MENU_OF2010H                       =   Office2010褐色
MENU_OF2010Y                       =   Office2010銀色

##
MENU_POP_LOCK                      =   鎖定對象
MENU_POP_UNLOCK                    =   解除所選對象
MENU_POP_PRE                       =   移前一位
MENU_POP_AFT                       =   移後一位
MENU_POP_TOP                       =   移後頂端
MENU_POP_BOT                       =   移後尾部
MENU_POP_FINISH                    =   結束(&F)
MENU_POP_COOR                      =   輸入坐標(&I)
MENU_POP_CLOSEFINISH               =   閉合結束(&C)
MENU_POP_MODIFYCOLOR               =   修改顏色
MENU_POP_MODIFPARAM                =   修改參數
MENU_POP_APPLYTOPICK               =   應用到選擇對象
MENU_POP_SETDFT                    =   設為預設筆
MENU_POP_SETMARK                   =   標刻開關


##DLG_ROT0
DLG_ROT0_TITLE                     =   旋轉角度標刻
DLG_ROT0_EXT_LJ                    =   零件
DLG_ROT0_CURTM                     =   當前時間
DLG_ROT0_ANGLE                     =   當前角度
DLG_ROT0_CNT                       =   加工總數
DLG_ROT0_TOTAL                     =   總時間
DLG_ROT0_MVRT                      =   運動角度
DLG_ROT0_CTWK                      =   連續加工
DLG_ROT0_SELWK                     =   選擇加工
IDC_CHK_MARK_WHOLE_SHAPE           =   圖形整體標刻
IDC_STATIC_GRAPH_GAP               =   圖形間距
DLG_ROT0_BTN_RDLT                  =   紅光指示
DLG_ROT0_BTN_MK                    =   標刻
DLG_ROT0_BTN_PARA                  =   參數
DLG_ROT0_BTN_EXIT                  =   退出
IDS_NO_MARK                        =   打標未開始......
IDS_MARK_FINISH                    =   打標結束
IDS_MARK                           =   標刻



##DLG_ANGLERORATE
IDC_RATE_TITLE                     =   擴展軸標刻
IDC_STATIC_RT_LJ                   =   零件
IDC_STATIC_CUR                     =   當前時間
IDC_STATIC_RATE_CNT                =   加工總數
IDC_STATIC_RATE_TOTAL              =   總時間
IDC_STATIC_STEP                    =   運動步長
IDC_STATIC_SPLIT                   =   分割尺寸
IDC_BUTTON_AXIS_DIA                =   工件直徑
IDC_STATIC_MM                      =   毫米
IDC_FOCUSLENGTH                    =   焦距

##DLG_旋轉標刻2
IDC_RATE2_TILTLE                   =   360度旋轉角度標刻
IDC_STATIC_ROT2_INC                =   增量
IDC_CHECK_360DG                    =   360度標刻
IDC_CHECK_TOTALNUM                 =   總數

##自動連接對話框
DLG_AUTO_CNN_TITLE                 =   自動連接
##改變文本話框                     =
DLG_CHGTXT_TITLE                   =   改變文字
IDC_STATIC_CHETXT                  =   原文字
IDC_STATIC_TXTDEST                 =   變換後的文字

##高級標刻參數
IDC_STATIC_ADV_JP                  =   跳轉速度
IDC_STATIC_JPDELAY                 =   跳轉位置延時
IDC_STATIC_JPDT_DELAY              =   跳轉距離延時
IDC_STATIC_EPOFF                   =   末點補償
IDC_STATIC_ACDT                    =   加速距離
IDC_STATIC_MKTM                    =   打點時間
IDC_PULSE_POINT_MODE               =   向量打點模式
IDC_STATIC_PERPULSE                =   每個點脈衝數
IDC_STATIC_MMS                     =   毫米/秒
IDC_STATIC_UM                      =   微米
##IDC_STATIC_UM2                   =   微米
IDC_STATIC_MS                      =   毫秒
IDC_WOBBLE                         =   抖動
IDC_STATIC_DIA                     =   直徑
IDC_STATIC_DIT                     =   間距
IDC_END_ADD_POINTS                 =   末尾加點
IDC_STATIC_NUM                     =   數目
IDC_STATIC_DITADV                  =   距離
IDC_STATIC_MKTIME                  =   打點時間
IDC_STATIC_MKCNT                   =   打點次數

##常用圖庫DLG
IDC_STATIC_LIB_NAME                =   圖庫名稱
IDC_STATIC_LIB_PRE                 =   圖片預覽
IDC_STATIC_LIB_TIP                 =   提示:按住鼠標左鍵選擇需要的圖形然後拖拉移動到工作區間
IDC_BUTTON_NEWLIB                  =   新建圖庫
IDC_BUTTON_DELLIB                  =   刪除圖庫
IDC_BUTTON_ADDIMG                  =   加入圖片
IDC_BUTTON_DELIMG                  =   刪除圖片
IDS_COMMON_IMG                     =   Common Image

##輸入端口窗口                     =
DLG_INPUT_TITLE                    =   輸入端口
IDC_STATIC_IOCTL                   =   輸入輸出控制

##IO 窗口
DLG_IO_TITLE                       =   IO
IDC_STATIC_INPUT_IO                =   輸入端口
IDC_STATIC_OUT_IO                  =   輸出端口

##控制對話框                       =
IDS_REDLIGHT                       =   紅光指示中....
IDS_MARKING_FLY                    =   飛行打標標刻中....
IDS_MARKING_INPUT                  =   輸入端口檢測打標中...
IDS_TMP_HIGH                       =   雷射器溫度過高，如要繼續打標，可在參數中設置不檢測雷射器狀態
IDS_LASER_CLOSED                   =   雷射器已關閉,如要繼續打標，可在參數中設置不檢測雷射器狀態
IDS_LASER_ABNORMAL                 =   雷射器：mo（主振蕩器）異常,如要繼續打標，可在參數中設置不檢測雷射器狀態
IDS_COMMON_IMG                     =   常用圖形
IDS_STATE_ERROR                    =   雷射器狀態檢測錯誤，請在參數中設置不檢測雷射器狀態
IDS_QUIT_MARK                      =   當前正在打標，確定退出打標嗎?
IDS_COM_ERROR                      =   com無法進行通訊，請檢測com狀態
##從參數庫取參數對話框             =
DLG_PUT_PARA_TITLE                 =   從參數庫取參數
IDC_BUTTON_SAVEAS                  =   當前參數另存為
IDC_BUTTON_DEL_SELECT              =   刪除被選擇的參數
IDC_BUTTON_SET_DEFAULT             =   參數設為預設值



##加入圖片對話框                   =
DLG_PIC_ATT_TITLE                  =   加入圖片
IDC_STATIC_PIC_NAME                =   請輸入圖像名稱

##加入圖庫對話框                   =
DLG_PIC_LIB_ATT_TITLE              =   加入圖庫
IDC_STATIC_LIB_PIC_NAME            =   請輸入圖庫名稱

##戒指標刻窗口                     =
DLG_RING_MK_TITLE                  =   戒指標刻
IDC_STATIC_RING_LJ                 =   零件
IDC_STATIC_RING_CUR                =   當前時間
IDC_STATIC_RING_CNT                =   加工總數
IDC_STATIC_RING_TIME               =   總時間
IDC_CHECK_SELECT                   =   選擇加工
IDC_CHECK_RING_INNER               =   戒指內環
IDC_STATIC_RING_DIA                =   戒指直徑
IDC_STATIC_RING_THK                =   戒指厚度
IDC_STATIC_RING_DEGREE             =   度
IDC_STATIC_RING_STEP               =   移動步長
IDC_CHK_MONITOR_INPORT             =   檢測輸入口信號


##配置參數對話框
DLG_CFG_PARA_TITLE                 =   配置參數
IDS_LASER_RING_PARAM_EXT           =   擴展軸
##
IDC_CHK_REV_ROT                    =   反轉
IDC_CHK_ROTATE                     =   旋轉軸
IDC_STATIC_EXT_MULSE               =   每轉脈衝數
IDC_STATIC_EXT1                    =   脈衝
IDC_STATIC_MININD                  =   最小坐標
IDC_STATIC_MAXIND                  =   最大坐標
IDC_STATIC_PULPERSEC               =   脈衝/秒
IDC_STATIC_PAREXT_MINV             =   最小速度
IDC_STATIC_PAREXT_MAXV             =   最大速度
IDC_STATIC_PAREXT_ACT              =   加速時間
IDC_STATIC_PAREXT_OFMV             =   補償移位
IDC_STA_RING_COMP_BL               =   比例補償
IDC_STA_RING_COMP_JX               =   間隙補償
IDC_STA_RING_COMP_CW               =   錯位補償
IDC_CHECK_FINISH_GOTOO_RI          =   加工結束回起始點
IDC_STATIC_WKFRE                   =   電機運行速度
IDC_CHECK_ZERO                     =   零點
IDC_STATIC_PAREXT_ZERO             =   回零速度
IDC_STATIC_PAREXT_ZESUP            =   回零超時
IDC_STATIC_SED                     =   秒
IDC_CHECK_ACCURATE                 =   精確回零

##按筆號選擇DLG
DLG_SEL_BY_PEN_TITLE               =   按筆號選擇對象
IDS_PEN_ID                         =   筆號
IDS_PEN_COLOR                      =   顏色

IDS_STEP_DIST                      =   步距(mm)
IDS_SPEED                          =   速度(mm/s)
IDS_LASER_POWER                    =   功率(%)
IDS_SAVE_CURRENT                   =   保存當前設置為缺省配置，成功!
IDS_PULSELOWMAXFREQ                =   脈衝頻率小於最小頻率
IDS_MINFREQ                        =   最小頻率

IDS_PULSEGREATEMAXFREQ             =   脈衝頻率大於最大頻率
IDS_MAXFREQ                        =   最大頻率
IDS_SPDLOWMINSPD                   =   速度小於最小速度！
IDS_MINSPD                         =   最小速度
IDS_SPDGREATEMAXSPD                =   速度大於最大速度！
IDS_MAXSPD                         =   最大速度
IDS_OPEN_SHX                       =   請先打開一個SHX文件
IDS_OPEN_DXFONT_ERR                =   打開單線字體失敗:
IDS_DRAW_SPIRAL_ERR                =   無法生成螺旋線
IDS_CREATE_SPIRAL_ERR              =   邊框尺寸太小，無法生成螺旋線
IDS_OPEN_PICTURE_ERR               =   打開圖片檔案失敗
IDS_GET_PICFILE_ERROR              =   調用圖片檔案失敗
IDS_PICTYPE_ERR                    =   不是正確的圖片檔案。
IDS_ONLY_DEAL_GRAYPIC              =   只能處理灰度圖片
IDS_INIT_BARERR                    =   條碼初始化失敗。
IDS_LOAD_FONT                      =   字體列表仍在加載中，請稍候再試
IDS_SELECT_ENTITY                  =   請先選擇一個外框對象
IDS_GAP_TIP                        =   間距不應小於0.01
IDS_MARK_MAP_ERR                   =   無法打標位圖
IDS_PARSE_HATCH_ERR                =   解析填充圖形出錯
IDS_COPY                           =   副本
IDS_OBJECT_LIST                    =   對象列表欄
IDS_WELDTO                         =   焊接於...
IDS_TRIMTO                         =   修剪於...
IDS_INTERSECTTO                    =   交叉於...
IDS_NAME                           =   名稱
IDS_TYPE                           =   類型
IDS_MARK_TYPE                      =   標記
IDS_TRUE_TYPE                      =   TrueType字體
IDS_JXF_FONT                       =   單線字體
IDS_BAR_FONT                       =   條形碼字體
IDS_ADMIN                          =   管理者
IDS_DESIN                          =   設計者
IDS_YEAR                           =   年
IDS_MONTH                          =   月
IDS_DAY                            =   天
IDS_LOCK                           =   鎖
IDS_PEN_ID                         =   筆號
IDS_PEN_COLOR                      =   顏色
IDS_PEN_SWITCH                     =   開關
IDS_ADVANCE                        =   進階...
IDS_APPLY_TO_DEFAULT               =   保存為預設參數
IDS_LOAD_DEFAULT                   =   加載預設參數
IDS_TYPENAME_SCREWLINE             =   螺旋線
IDS_AUTOSAVE_CHECK                 =   每
IDS_AUTOSAVE_STATIC_MINUTE         =   分鐘，自動保存
IDR_TOOLBAR_DRAW                   =   顯示或隱藏繪圖工具欄
IDS_TIPS_ZOOM_MAX                  =   顯示或隱藏放縮工具欄
IDS_TIPS_ROTATE_RANGLE             =   旋轉中心超出範圍！
IDS_SETTING_TREE_GENERAL           =   常規
IDS_SETTING_TREE_COLOR             =   顏色
IDS_SETTING_TREE_WORKPLACE         =   工作區間
IDS_SETTING_TREE_AUTOSAVE          =   自動保存
IDS_SETTING_TREE_MOVEROTATE        =   移動旋轉
IDS_SETTING_TREE_PLUGMANAGE        =   插件管理
IDS_SETTING_TREE_USER              =   用戶管理
IDS_SETTING_TREE_LANGUAGE          =   語言
IDS_SET_G_UNIT_TYPE                =   單位類型
IDS_SET_G_PASTE_X                  =   水平黏貼偏移
IDS_SET_G_PASTE_Y                  =   垂直黏貼偏移
IDS_SET_G_GRID                     =   網格
IDS_SET_G_SHOWGRID                 =   顯示網格
IDS_SET_G_GRID_DISTANCE            =   網格間距
IDS_SET_G_I_MASK                   =   輸入IO掩碼
IDS_SET_G_O_MASK                   =   輸出IO掩碼
IDS_SET_G_MARKING_MUTEX            =   啟用標刻互斥量
IDS_SET_G_EXECUTE_START            =   當主程序啟動時，運行程序
IDS_SET_G_EXECUTE_FINISH           =   當主程序關閉時，運行程序
IDS_TYPENAME_ELLIPSE               =   橢圓(弧)
IDS_SAVE_FINISH                    =   保存完畢
IDS_TYPENAME_ELLIPSEARC            =   橢圓弧
IDS_TYPENAME_CIRCLE                =   圓(弧)
IDS_STRAT_DEGREE                   =   開始角度
IDS_END_DEGREE                     =   結束角度
IDS_DEGREE                         =   度
IDS_TYPENAME_RECTANGLE             =   矩形
IDS_ROUND_STEP                     =   圓角程度
IDS_ROUND_ALL                      =   所有邊圓角
IDS_TYPENAME_BEZIER                =   曲線
IDS_INCH                           =   英寸
IDS_MM                             =   毫米
IDS_BK                             =   背景
IDS_CENTERLINE                     =   中心線
IDS_TYPENAME_TEXT                  =   文本
IDS_TYPENAME_PICTURE               =   圖片
IDS_SHOW_WORKSPACE                 =   顯示工作區間
IDS_SHOW_ROUND                     =   顯示圓形區間
IDS_SHOW_CROSS                     =   顯示中心十字線
IDS_LOWERLEFT                      =   左下角
IDS_SIZE                           =   尺寸
IDS_HEIGHT                         =   高度
IDS_WIDTH                          =   寬度
IDS_FUNC_ERROR                     =   應該在派生類中實現此函數
IDS_CHOOSE_COLOR                   =   請先選擇顏色
IDS_EXIT_ROTATE                    =   當前正在打標，確定退出旋轉打標嗎?
IDS_SPLIT_OUTRANGE                 =   分割尺寸必須小於工件半徑!
IDS_ROTARYMARK                     =   擴展軸標刻
IDS_CURNUMGREATETOTALNUM           =   當前加工數已經大於加工總數，請復位當前加工數後再加工！
IDS_TIPS_TURN_D2                   =   切換至列表屬性欄
IDS_ERR_DOOROPEN                   =   安全門被打開，請關閉安全門!
IDS_CHANGE_TEXT                    =   請輸入要切換的文字！該值不能為空！
IDS_PSWINCORRECT                   =   密碼不正確，請重新輸入!
IDS_QUIT_MARK                      =   當前正在打標，確定退出打標嗎?
IDS_SAVE_CURRENT                   =   保存當前設置為缺省配置，成功!
IDS_PULSELOWMAXFREQ                =   脈衝頻率小於最小頻率
IDS_MINFREQ                        =   最小頻率
IDS_PULSEGREATEMAXFREQ             =   脈衝頻率大於最大頻率
IDS_MAXFREQ                        =   最大頻率
IDS_SPDLOWMINSPD                   =   速度小於最小速度！
IDS_MINSPD                         =   最小速度
IDS_SPDREATEMAXSPD                 =   速度大於最大速度！
IDR_TOOLBAR_ASSISTANT              =   輔助工具欄。圖形鎖定、解鎖，置於原點等。
IDS_TIPS_TURN_D1                   =   切換至標刻參數欄
IDS_MK_OPER                        =   標刻操作欄

IDS_OPEN_COM_ERR                   =   打開串口失敗！
IDS_PWD_ERROR                      =   兩次輸入的密碼不一致
IDS_USER_EXIST                     =   您輸入的用戶名已經存在！請重新輸入一個用戶名！
IDS_INPUT_USER                     =   請輸入一個用戶名！
IDS_INVALID_BAR                    =   無法支持的條碼內容，請重新設置條碼內容！
IDS_TIPS_ZOOM_MIN                  =   尺寸 <0.001mm 超出精度！
IDS_MARKING                        =   正在標刻中......
IDS_STOP_MARK                      =   停止標刻
IDS_MARK_STOPPED                   =   打標已經停止！
IDS_POWER_ON                       =   電源開
IDS_POWER_OFF                      =   電源關
IDS_STEP_MARK                      =   標刻步距(毫米)
IDS_CURRENT                        =   電流(A)
IDS_SPEED                          =   速度(毫米/秒)
AFX_IDS_APP_TITLE                  =   SeaCad
IDS_APP_TITLE                      =   LMC1
IDS_INPUT_NUM                      =   請鍵入壹個數字
IDS_TIP_MAX_DA                     =   最大DA值為：4096
IDS_DISTORTION                     =   參數範圍為0.8~1.2
IDS_LINKERROR                      =   無法連接到激光控制卡，請檢測控制卡連接狀態！
IDS_PAR_CAL_ERRPR                  =   參數計算錯誤
IDS_FLY_MARK_PARA_CAL              =   飛行參數計算
IDS_PWD_ERROR_                     =   密碼錯誤！
IDS_LASER_OUT                      =   按確定將輸出激光，妳確認要輸出激光嗎？

IDS_WARING                         =   警告
IDS_PORT_ERROR                     =   請註意輸出端口有沖突！請重新選擇！
IDS_PWD_CON_EEROR                  =   兩次輸入的密碼不壹致，請重新輸入！
IDS_ENABLE_POWER                   =   使能功率模擬口輸出
IDS_POWER_MAP                      =   功率映射
IDS_ENABLE_ANGLOG_OUT              =   使能電流輸出
IDS_ANALOG_MAP                     =   電流映射
IDS_LASER_ON                       =   開激光
IDS_LASER_OFF                      =   關激光
IDS_LASER_TEST                     =   激光測試
IDS_CON                            =   新的飛行速度系數為：
IDS_USE_CON                        =   使用該系數請點擊【確定】！
IDS_FIELD                          =   區域
IDS_LASER_CONTROL                  =   激光控制
IDS_PORT                           =   端口
IDS_OTHER                          =   其它
IDS_TYPENAME_INPUT                 =   輸入端口
IDS_TYPENAME_OUTPUT                =   輸出端口
IDS_TYPENAME_POLYGON               =   多邊形
IDS_TYPENAME_COMBINE               =   組合
IDS_TYPENAME_POINT                 =   點
IDS_TYPENAME_DELAYEDTIMER          =   延時器

IDR_TOOLBAR_ALIGN                  =   顯示或隱藏對齊工具欄
IDS_NEW_LIB_TIP                    =   請先建立圖庫，然後再保存圖像！
IDS_INPUT_IMGNAME                  =   請輸入圖像名稱
IDS_HAVEIMG_TIP                    =   指定的圖像已經存在，請重新輸入
IDS_INPUT_LIBNAME                  =   請輸入圖庫名稱
IDS_HAVELIB_TIP                    =   指定的圖庫已經存在!，請重新輸入
IDS_PARAMNAMEEXIST                 =   參數名稱已經存在！覆蓋舊參數嗎？
IDS_REALYAPPDEF                    =   妳確認要應用當前參數為默認參數嗎？
IDS_CHECK_LINK                     =   打標控制卡連接發生錯誤，請檢測連接......
IDS_ENCRYPTION_ERR                 =   板卡加密認證失敗
IDS_NO_OBJECT                      =   沒有對象被選取
IDS_SELECT                         =   選取
IDS_OBJECT_SELECTED                =   對象被選取
IDS_OBJECT                         =   對象:
IDS_DEV_COR                        =   設備坐標
IDS_PAPER_COR                      =   圖紙坐標
IDS_ZOOM_SCALE                     =   顯示倍數

IDS_NOENTITY_SELECT                =   沒有可加工的數據，請檢查是否選擇了加工對象
IDS_NOENTITY                       =   沒有可加工的數據，請檢查文件是否載入！
IDS_CACHE_FULL                     =   打標緩存已滿，請檢測達標卡狀態!點擊[確定]重試。
IDS_PLT_TIPS                       =   plt文件空格後應為數字或“+、-”號！
IDS_SELECT_ERR                     =   未選擇正確的對象,請重新選擇!
IDS_CANNOT_OPEN_FILE               =   文件無法打開!
IDS_PLT_INVALID_CHAR               =   PLT文件中有非法字符！
IDS_ENCODE_ERR                     =   硬件系統加密失敗，系統將停止工作
IDS_VERSION_ERR                    =   軟件版本和硬件系統不兼容！
IDS_ERROR                          =   錯誤
IDS_LINK_ERR                       =   無法連接打標控制卡，程序進入演示模式(不能打標)!
IDS_NOFONTS                        =   系統中無可用字體，請與管理員聯系
IDS_INVALID_FONT                   =   無效的字體，換用別的字體。
IDS_ERR_BAR_TYPE                   =   無法查找的條碼類型
IDS_OPEN_LINEFILE_ERR              =   打開單線文件失敗:
IDS_TCP_LINK_ERR                   =   連接通訊服務器失敗！
IDS_TYPENAME_CODEBAR               =   條碼
IDS_TYPENAME_FILLED                =   填充
IDS_STATUS                         =   無選取

IDS_MOUSE_XY                       =   坐標
IDS_FILESAVE_STRING                =   是否保存當前文件？
IDS_FILESAVE_TITLE                 =   保存提示
IDS_TYPENAME_LINE                  =   直線
IDS_TYPENAME_POLYLINE              =   多直線段
IDS_TYPENAME_GROUP                 =   群組
IDS_SWITCH_ON                      =   開
IDS_SWITCH_OFF                     =   關

IDS_READY                          =   就緒
IDS_SNAP                           =   捕捉
IDS_GUID_LINE                      =   輔助線

## 密碼對話框                      =
DLG_PWD_TITLE                      =   密碼設置
IDC_STATIC_NAME                    =   用戶名
IDC_STATIC_PWD                     =   密碼
IDC_STATIC_CFMPWD                  =   確認密碼

##Rotate Param Config and Axis check DLG        
IDD_DLG_ROTATE_CFG                 =   旋轉參數配置與旋轉軸檢查
IDC_STATIC_ROT_STEP_ANGLE          =   移動角度

##旋轉角度標刻參數設置DLG          =
DLG_ROT_ANG_TITLE                  =   旋轉角度標刻參數設置

##輸入參數名稱DLG                  =
DLG_INPUT_PARA_TITLE               =   輸入參數名稱
##工件直徑DLG                      =
DLG_WKDIA_TITLE                    =   工件直徑

##轉為虛線DLG                      =
DLG_TRAN_TITLE                     =   轉為虛線
IDC_STATIC_LINELEN                 =   線長-L1
IDC_STATIC_LINEINTER               =   間隔-L2

##條形碼 DLG                       =
DLG_BARCODE_TITLE                  =   條形碼
IDC_STATIC_TEXT                    =   文本
IDC_CHECK_SHOW_TEXT                =   顯示文本
IDC_STATIC_TXTHIT                  =   文本高度
IDC_STATIC_TEXTWID                 =   文本寬度
IDC_TEXT_OFFSETX                   =   文本X偏移
IDC_TEXT_OFFSETY                   =   文本Y偏移
IDC_TEXT_TEXTSPACE                 =   文本間距
IDC_CHECK_REVERT                   =   黑白反轉
IDC_GRP_QUIET                      =   空白
IDC_STATIC_TOP                     =   頂部
IDC_STATIC_LEFT                    =   左邊
IDC_STATIC_RIGHT                   =   右邊
IDC_STATIC_BOTTOM                  =   底部
IDC_STATIC_HEIGHT                  =   條碼高度
IDC_STATIC_STAWD                   =   標準模塊寬度
IDC_STATIC_RATIO                   =   比例
IDC_STATIC_BAR                     =   條
IDC_STATIC_SPACE                   =   空
IDC_STATIC_PENID                   =   筆號
IDC_STATIC_FONT                    =   字體

##GCODE 對話框
DLG_CGODE_TITLE                    =   GCODE

##填充對話框                       =
DLG_FILL_TITLE                     =   填充
IDC_CHECK_ENABLE_OUTLINE           =   使能輪廓
IDC_CHECK_OUTLINE_FIRST            =   輪廓優先
IDC_RADIO_FILL_1                   =   填充1
IDC_RADIO_FILL_2                   =   填充2
IDC_RADIO_FILL_3                   =   填充3
IDC_CHECK_ENABLE                   =   使能
IDC_STATIC_TYPE                    =   類型
IDC_CHECK_COUNT_ALL                =   對象整體計算
IDC_CHECK_ROUND_INVERT             =   反轉
IDC_CHECK_ALONG_BORDER             =   繞邊走壹次
IDC_CHECK_KEEP_SEPERATE            =   保留填充對象的獨立
IDC_STATIC_ANGLE                   =   角度
IDC_GRP_MUTCP                      =   多圖形運算
IDC_RADIO_EXECUTE                  =   默認
IDC_RADIO_EXECUTE_2                =   交集
IDC_RADIO_EXECUTE_3                =   並集
IDC_RADIO_EXECUTE_4                =   差集
IDC_STATIC_LISTDIST                =   線間距
IDC_CHECK_ARRANGE_EQUALLY          =   平均分布填充線
IDC_STATIC_EDG                     =   邊距
IDC_STATIC_STARTOFFSET             =   開始偏移
IDC_STATIC_ENDOFFSET               =   結束偏移
IDC_STATIC_LINEREDUCTION           =   直線縮進
IDC_STATIC_NUMLOOPS                =   邊界環數
IDC_STATIC_LOOPDIST                =   環間距
IDC_BUTTON_DEL                     =   刪除填充
##路徑文本DLG                      =
DLG_PATH_FONT_TITLE                =   路徑文本
IDC_STATIC_BASEANG                 =   基準角度
IDC_CHECK_BASE                     =   角度範圍
IDC_CHK_INVERT                     =   文字反排
IDC_CHK_ALLIG_TOP                  =   文字頂端對齊
##字體 DLG
DLG_FONT_TITLE                     =   字體
IDC_STATIC_ALLIGN                  =   對齊方式
IDC_RADIO_ALIGN_LEFT               =   左
IDC_RADIO_ALIGN_LEFT3              =   中
IDC_RADIO_ALIGN_LEFT2              =   右
IDC_CHECK_BOLD                     =   粗體
IDC_CHECK_ITALIC                   =   斜體
IDC_CHECK_EUQAL_WIDTH              =   使能等寬字符
IDC_STATIC_CH_WID                  =   字符寬度
IDC_STATIC_CHA_ANG                 =   字符角度
IDC_STATIC_CHA_INT                 =   字符間距
IDC_STATIC_LINE_INT                =   行間距
IDC_STATIC_CHA_HEI                 =   %   字符高度
IDC_STATIC_DEGREN                  =   度   (-89,89)
IDC_STATIC_DIR                     =   排列方向
IDC_RADIO_HORIZONTAL               =   水平
IDC_RADIO_VERTICAL                 =   垂直
IDC_CHECK_ROUND                    =   圓弧文本
IDC_STATIC_DIA_C                   =   圓半徑
IDC_CHECK_INVERT                   =   文字反排
IDC_CHECK_UPSIDEDOWN               =   文字倒立
IDC_CHECK_LIMIT_ANGLE              =   角度範圍限制
ID_BUTTON_APPLY                    =   應用

##輸入坐標 DLG
DLG_INPUT_IND_TITLE                =   輸入坐標

##用戶選擇 DLG                     =
DLG_USER_SEL_TITLE                 =   用戶選擇
IDC_STATIC_USER                    =   用戶
IDC_STATIC_PWD                     =   密碼

##標刻控制--暫時不用               =

IDC_BUTTON_MARK                    =   標刻(F2)
IDC_CHECK_CONTINUOUS               =   連續加工
IDC_CHECK_SELECT                   =   選擇加工
IDC_STATIC_PART                    =   零件
IDC_STATIC_TOTAL                   =   總數
IDC_BUTTON_POWERON                 =   電源開
IDC_BUTTON_PARAM                   =   參數(F3)

##參數DLG
IDC_CHK_DEFAULT_PARAM              =   使用默認參數
IDC_STATIC_CUR_PEN                 =   當前筆號
IDC_STATIC_MACHINE_COUNT           =   加工數目
IDC_STATIC_RUN_SPEED               =   速度
IDC_STATIC_LASER_POWER             =   功率
IDC_STATIC_LASER_HZ                =   頻率(KHZ)
IDC_STATIC_ZKB                     =   脈寬(ns)
IDC_STATIC_OPEN_DELAY              =   開光延時(us)
IDC_STATIC_SHUT_DELAY              =   關光延時(us)
IDC_STATIC_END_DELAY               =   結束延時(us)
IDC_STATIC_CORNER_DELAY            =   拐角延時(us)
IDC_STATIC_STEP_DELAY              =   步間延時(us)
IDC_ADVANCE                        =   高級
IDC_STATIC_PARNM                   =   參數名稱
IDC_LOAD_DEFAULT                   =   讀取原有參數
IDC_SAVE                           =   保存當前參數
IDC_SAVE_DEFAULT                   =   保存為默認參數
IDS_DEFAULT_PARAM                  =   使用默認參數
##陳列DLG
DLG_MATR_TITLE                     =   陣列
IDC_GROUPBOX_ARRAY                 =   陣列類型
IDC_RADIO_RECTANGLE                =   矩陣
IDC_RADIO_CIRCLE                   =   圓陣

##
IDC_STATIC_MATNUM                  =   陣列數目
IDC_STATIC_MATDIA                  =   半徑
IDC_STATIC_MATSTANGLE              =   開始角度
IDC_STATIC_MATAGDIT                =   角度間距
IDC_RADIO_DIRECTION                =   向心
IDC_RADIO_DIRECTION2               =   正向

##
IDC_HOR_NUM                        =   橫向數目
IDC_VER_NUM                        =   縱向數目
IDC_HOR_DIST                       =   橫向間距
IDC_VER_DIST                       =   縱向間距
IDC_GROUPBOX_DISTANCE              =   間距計算方法
IDC_RADIO_OP                       =   按偏移距離計算
IDC_RADIO_SP                       =   按圖形的間距計算

##
DLG_CHG_TITLE                      =   變換

##
IDC_STATIC_POST                    =   位置
IDC_CHK_RELATIVE_POS               =   相對位置
IDC_BTN_APPLY_COPY                 =   應用到復制對象
IDC_BTN_APPLY                      =   應用
##
IDC_STATIC_ANG                     =   角度
IDC_STATIC_CENT                    =   中心
IDC_CHK_RELATIVE_POS               =   相對中心
##比例                             =
IDC_STATIC_RATIO                   =   比例
IDC_STATIC_OBJECT                  =   對象

##尺寸
IDC_STATIC_SIZE                    =   尺寸
##
IDC_STATIC_SLOPE                   =   傾斜
## 名稱 DLG                        =
DLG_NAME_TILTE                     =   名稱
##
DLG_BASE_SEL_POS_TITLE             =   選擇位置坐標的基準
##
IDC_STATIC_POST                    =   位置
IDC_BTN_TEAM                       =   陣列
IDC_BTN_INPORT                     =   輸入端口
##
IDC_STATIC_STARTDEG                =   開始角度
IDC_STATIC_ENDDEG                  =   結束角度

##
DLG_ARR_TITLE                      =   陣列
IDC_STATIC_NUM                     =   數目
IDC_STATIC_INC                     =   增量[毫米]

##
IDC_STATIC_DIA                     =   半徑
##
IDC_STATIC_WTM                     =   等待時間
##
IDC_STATIC_MVDST                   =   編碼器移動距離
##
IDC_BUTTON_FILL                    =   填充
IDC_BUTTON_BAR_OPTION              =   條碼
IDC_STATIC_HEIGHT                  =   高度
IDC_CHECK_VARIABLE_TEXT            =   使能變量文本
IDC_RADIO_TEXT_DISTANCE            =   間距
IDC_STATIC_DISTANCE_CONTROL        =   距離控制
IDC_RADIO_TEXT_DISTANCE2           =   中心距
IDC_BUTTON_ADD                     =   增加
IDC_BUTTON_DEL                     =   刪除
IDC_BUTTON_MOVEUP                  =   上移
IDC_BUTTON_MOVEDOWN                =   下移
IDC_BUTTON_MODIFY                  =   修改
##
IDC_STATIC_IOCON                   =   I/O控制條件
IDC_STATIC_TIP                     =   提示消息
IDC_CHK_ENABLE                     =   使能
##
IDC_GROUPBOX_OUTPUT                =   設置輸出端口
IDC_STATIC_US                      =   微秒
##
IDC_CHECK_DPI_FIXED                =   固定DPI
IDC_CHECK_GRAY                     =   灰階
IDC_BTN_BMP_PROCESS_EXPAND         =   擴展
IDC_STATIC_DBD                     =   對比度
IDC_STATIC_BRI                     =   亮度
IDC_CHECK_CELL                     =   網點
IDC_STATIC_TRIG                    =   閥值
IDC_CHECK_DUAL_DIRECTION           =   雙向掃描
IDC_CHECK_DOT_MODE                 =   打點模式
IDC_CHECK_AD_PT                    =   調整點功率
##
IDC_STATIC_EDN                     =   邊數
##
DLG_LX_TITLE                       =   螺旋線
IDC_BUTTON_TYPE                    =   type
IDC_BUTTON_DIR                     =   Direction
IDC_STATIC_PENID                   =   筆號
IDC_STATIC_MINRAD                  =   最小半徑
IDC_STATIC_MIN_DIT                 =   最小螺旋線螺距
IDC_STATIC_MAXDIT                  =   最大螺旋線螺距
IDC_STATIC_VAR                     =   螺距變化量
IDC_STATIC_OUTEDG                  =   外邊界環數
IDC_STATIC_INNER                   =   內邊界環數

##
DLG_SYS_PARA_TITLE                 =   系統參數
##
IDC_CHECK_USEPWD                   =   使用軟件必須輸入密碼
IDC_STATIC_USER                    =   用戶
IDC_BUTTON1                        =   增加
IDC_BUTTON4                        =   修改
IDC_BUTTON11                       =   刪除
##
IDC_STATIC_KEYBD                   =   鍵盤
IDC_STATIC_MIDIT                   =   微調距離
IDC_STATIC_BIGRAT                  =   大調整比例
IDC_STATIC_RAT                     =   旋轉角度
IDC_STATIC_ORI                     =   回原點方式
IDC_STATIC_INOR                    =   輸入回零
##
IDC_STATIC_PORT                    =   端口
IDC_STATIC_BIT                     =   波特率
IDC_STATIC_DATABIT                 =   數據位
IDC_STATIC_STPBIT                  =   停止位
IDC_STATIC_MOD                     =   奇偶校驗
IDC_STATIC_CMD                     =   命令
##文本元素對話框                   =
DLG_TXT_ELE_TITLE                  =   文本元素
IDC_STATIC_ELETYPE                 =   元素類型
IDC_RD_FIXTXT                      =   固定文本
IDC_RD_SERTXT                      =   序列號
IDC_RD_DATE                        =   日期
IDC_RD_TIME                        =   時間
IDC_RD_TCP                         =   網絡通訊
IDC_RD_COM                         =   串口通訊
IDC_RD_SQL                         =   SQL數據庫
IDC_RD_FILE                        =   文件
IDC_RD_KEY                         =   鍵盤
IDC_CHECK_NO_LEAD_ZERO             =   不使用前導零
IDC_STATIC_TEXT                    =   文本
IDC_GROUP_TEXTTYPE                 =   文本類型
IDC_RADIO_TEXTTYPE                 =   文本
IDC_RADIO_TEXTTYPE2                =   換行符
IDC_RADIO_TEXTTYPE3                =   用戶名

##
IDC_STATIC_STINDEX                 =   開始序號
IDC_STATIC_CURINDEX                =   當前序號
IDC_STATIC_ENDINDEX                =   最終序號
IDC_STATIC_INCR                    =   序號增量
IDC_STATIC_PERMK                   =   每個標刻數
IDC_STATIC_MODE                    =   模式
IDC_STATIC_RESET                   =   復位
IDC_STATIC_CURMK                   =   當前標刻數
IDC_CHECK_FILTER_SN                =   過濾以下序號
##
IDC_STATIC_SQLDR                   =   SQL驅動
IDC_STATIC_SRC                     =   數據源
IDC_STATIC_DB                      =   數據庫名
IDC_STATIC_ID                      =   用戶ID
IDC_STATIC_PWD                     =   密碼
IDC_STATIC_SQLCMD                  =   SQL命令
IDC_STATIC_LINE                    =   行號
IDC_STATIC_INC                     =   增量
IDC_CHECK_AUTO_RESET               =   自動復位
IDC_CHECK_READ_ALL                 =   每次讀整個文件
##
IDC_STATIC_IPADD                   =   IP地址
IDC_STATIC_PORT                    =   端口號
IDC_STATIC_CMD                     =   命令
IDC_CHECK_UNICODE                  =   Unicode
##
IDC_RADIO1_H24                     =   小時-24
IDC_RADIO2_H12                     =   小時-12
IDC_RADIO3_MIN                     =   分鐘
IDC_RADIO4_SEC                     =   秒
IDC_RADIO5_QU                      =   時間段
IDC_STATIC_AM_START                =   AM開始時間
IDC_STATIC_PM_START                =   PM開始時間
##
DLG_PIC_PROP_TITLE                 =   圖片屬性
IDC_STATIC_PRE                     =   圖片預覽
IDC_STATIC_FILE                    =   文件

##DLL- 窗口
DLG_FLY_TITLE                      =   飛行標刻設置
IDC_CHECK_FLYMARK                  =   飛行標刻
IDC_CHECK_RISING_EDGE              =   上升沿觸發
IDC_FLYRIGHT2LEFT                  =   流水線方向從右到左
IDC_FLYCONTINUEMODE                =   流水線連續模式
IDC_CHECK_SIM_FLY                  =   使能硬件模擬飛行
IDC_STATIC_LAN                     =   線纜標刻
IDC_STATIC_MKDIST                  =   標刻間距
IDC_STATIC_INI                     =   初始移動距離
IDC_STATIC_FLYV                    =   飛行速度系數
IDC_STATIC_UNIT                    =   微米/脈沖
IDC_BTN_COMPUTE                    =   計算
IDC_STATIC_INPUTPORT               =   輸入端口
##
DLG_CMP_RATIO_TITLE                =   計算比例
IDC_STATIC_OBSIZE                  =   目標標刻尺寸
IDC_STATIC_FTSIZE                  =   實際標刻尺寸
##
DLG_A_TITLE                        =   電流映射
IDC_STATIC_RAFAT                   =   實際比例(%)
IDC_CHECK_DA                       =   DA map(0-4096)
##
IDC_STATIC_ASPECT                  =   外觀
IDC_STATIC_ARE                     =   區域尺寸
IDC_STATIC_OFX                     =   偏移X
IDC_STATIC_OFY                     =   偏移Y
IDC_STATIC_ANGLE                   =   角度
IDC_GALVO_1                        =   振鏡1 = x
IDC_GALVO_2                        =   振鏡2 = x
IDC_STATIC_GOTO                    =   加工後去指定位置
IDC_NO_MOVE                        =   不移動
IDC_MOVE_TO_CENTER                 =   振鏡中心
IDC_MOVE_LEFT_TOP                  =   對象左上角
IDC_MOVE_RIGHT_TOP                 =   對象右上角
IDC_MOVE_RIGHT_BT                  =   對象右下角
IDC_MOVE_LEFT_BT                   =   對象左下角
IDC_MOVE_SEP                       =   指定位置
IDC_STATIC_P1                      =   振鏡1
IDC_STATIC_P2                      =   振鏡2
IDC_REVERSE1                       =   反向
IDC_STATIC_RATIV                   =   比例
IDC_STATIC_PWD                     =   密碼


##
DLG_FLY_SET_TITLE                  =   飛行參數計算
IDC_STATIC_FLY_TIP                 =   請手動控制流水線移動壹小段距離;測量該距離並填入運行距離輸入框內;點擊計算後程序自動計算
IDC_STATIC_LEN                     =   運行距離:
IDC_STATIC_MUL                     =   脈沖量:
IDC_BTN_ZERO_CLEAR                 =   清零
IDC_BTN_CALC_START                 =   開始運動
IDC_BTN_CALC_FINISH                =   結束運動
IDC_BTN_CALC_SPEED                 =   計算速度

##
DLG_FREQ_TITLE                     =   頻率
IDC_STATIC_FREQK                   =   頻率(KHz)
IDC_STATIC_FARAT                   =   實際比例

##
DLG_PWD_SET_TITLE                  =   密碼

##
DLG_TEST_LAS_TITLE                 =   測試激光
IDC_BTN_LASERON                    =   開激光
IDC_STATIC_FREQ                    =   頻率
IDC_STATIC_PW                      =   功率
IDC_STATIC_MUWI                    =   脈沖寬度
IDC_STATIC_ONTM                    =   激光開啟時間
##
IDC_STATIC_STMKDEL                 =   開始標刻延時
IDC_STATIC_ENDMKDEL                =   結束標刻延時
IDC_STATIC_MAXPW                   =   最大功率延時
IDC_STATIC_MAXFR                   =   最大頻率延時
IDC_STATIC_LASMSL                  =   激光器休眠時間
IDC_STATIC_MAXV                    =   最大速度
IDC_STATIC_MINV                    =   最小速度
IDC_STATIC_BUVMIS                  =   曲線離散誤差
IDC_SHOW_START_MARK_DLG            =   顯示開始標刻對話框
IDC_ENABLE_CMD_FILE                =   使能執行標刻開始和結束命令文件
IDC_AUTO_RESET_MARK_COUNT          =   自動復位加工次數
IDC_DISABLE_REACH_TOTAL_COUNT      =   加工到指定數目後禁止加工
IDC_ENABLE_POWEROFF_SAVE_FILE      =   斷電自動保護文件
IDC_DISABLE_OPTIMIZE               =   禁止連續加工模式的優化模式
IDC_STATIC_TOTM                    =   總加工時間
IDC_STATIC_TOTLJ                   =   總零件數
IDC_ENABLE_ANALOG                  =   使能模擬電流抑制
IDC_ENABLE_OFFLINE                 =   使能離線打標
IDC_STATIC_RPCNT                   =   (重復次數
IDC_USE_STEP_MARK_MODE             =   使用步距標刻模式
IDC_BUTTON_FLY                     =   飛行打標
IDC_BUTTON_REDLIGHT                =   紅光指示(F1)
##
IDC_STATIC_STOPPT                  =   停止加工輸入端口
IDC_STATIC_STOPTIP                 =   停止加工時的提示消息
IDC_STATIC_DRPORT                  =   門端口
IDC_STATIC_IPORT                   =   輸入端口
IDC_STATIC_LAMOT                   =   激光電源輸出口
IDC_STATIC_PRT                     =   端口
IDC_STATIC_RDPT                    =   紅光指示輸出口
IDC_STATIC_OPT                     =   輸出端口
IDC_STATIC_INPUT                   =   輸入端口
IDC_STATIC_MKOUT                   =   標刻輸出口
IDC_STATIC_STPT                    =   開始標刻端口
IDC_CHECK1                         =   開始信號脈沖模式
IDC_STATIC_ROTPT                   =   旋轉標刻信號端口

##
DLG_POWER_TITLE                    =   功率設置
IDC_STATIC_PW                      =   功率(%)
IDC_STATIC_FTRT                    =   實際比例(%)

##
DLG_PWDDLL_SET_TITLE               =   密碼設置
IDC_STATIC_PWDDLL                  =   密碼
##
DLG_REDLT_TITLE                    =   紅光指示
IDC_STATIC_RDV                     =   紅光速度
IDC_CHECK_ENRD                     =   使能顯示輪廓
IDC_CHECK_ENCTWK                   =   使能紅光連續加工模式
IDC_STATIC_SIZERTX                 =   尺寸比例X
IDC_STATIC_SIZERTY                 =   尺寸比例Y
IDC_BTN_REDLIGHT_PREVIEW           =   紅光預覽

##
DLG_CFG_MAK_TITLE                  =   配置參數
##
IDC_STATIC_LASTYPE                 =   激光器類型
IDC_STATIC_PMW                     =   PWM
IDC_CHECK_PWM_OUT                  =   使能PWM信號輸出
IDC_STATIC_MAXPWM                  =   最大PWM信號
IDC_STATIC_MINPWM                  =   最小PWM信號
IDC_STATIC_KHZ                     =   KHz
IDC_PWM_POWER_MAP                  =   功率映射
IDC_CHECK_TICKLE                   =   使能預電離
IDC_STATIC_MULW                    =   脈沖寬度
IDC_STATIC_MULFR                   =   脈沖頻率
IDC_CHECK_FPK                      =   使能CO2首脈沖抑制
IDC_STATIC_FMPW                    =   首脈沖抑制起始功率
IDC_CHECK_FPK_MODE                 =   使能CO2超脈沖抑制
IDC_STATIC_MNOUT                   =   模擬輸出
IDC_POWER_ANGLOG_OUT               =   使能電流輸出
IDC_FREQ_ANGLOG_OUT                =   使能頻率模擬輸出
IDC_ANALOG_FIRSTPULSEKILLER        =   使能模擬的首脈沖抑制
IDC_STATIC_SWITCH                  =   開關
IDC_CHECK_USE_QSWITCH              =   使用數字Q開關驅動器
IDC_CHECK_QSWITCH_OPEN_FPK         =   當首脈沖抑制結束時開Q開關
IDC_STATIC_FMS                     =   首脈沖抑制
IDC_CHECK_FIRSTPULSE_REVERSE       =   脈寬反轉
IDC_CHEK_LASM_SIG                  =   不檢測激光器反饋信號
IDC_OPEN_MO                        =   開啟MO延時
IDC_STATIC_WAVE                    =   波形
IDC_CHECK_PWM_OUT5                 =   連續模式
IDC_STATIC_WTPW                    =   待測功率
IDC_POWER_MAP                      =   電流映射
IDC_FREQ_MAP                       =   頻率映射
IDC_BTN_LASER                      =   測試激光
##
DLG_DLLTIP_TITLE                   =   提示
IDC_STATIC_ISSTART                 =   是否開始標刻
##
IDS_ALARM_STATE                    =   設置不檢測激光器狀態,可能會影響激光器性能!
##
STOP                               =   停止
IDS_WAIT_HOST                      =   WAIT FOR ANSWER...
IDS_REDLIGHT                       =   紅光指示中...
##
IDC_STATIC_INTER                   =   交叉處理後
IDC_CHECK_KEEP_ORIGINAL            =   保留原始對象
IDC_CHECK_KEEP_OBJECTIVE           =   保留目標對象
IDC_BTN_HANJIE                     =   焊接於...
##
IDC_STATIC_CUT_LEN                 =   剪除長度
IDC_STATIC_AUTODIT                 =   自動連接間距
IDC_STATIC_MULCP                   =   多圖運算
##
IDC_STATIC_INVAL                   =   此次改動將在下次啟動時生效
IDC_STATIC_PASTEY3                 =   (註：系數越小,點越多,越平滑)
IDC_STATIC_PASTEY2                 =   平滑系數
IDC_CHK_MULTIMARK                  =   多卡標刻
IDC_CHECK_CORFILE                  =   使用校正文件
IDC_STATIC_FIRSTIN                 =   首脈沖抑制功率增量
IDC_CHECK_START_PULSE              =   開始信號脈沖模式
IDS_CHAR_MODL                      =   十進制;十六進制大寫;十六進制小寫
IDC_STATIC_DTOFF                   =   日期偏移
BYYEAR                             =   按年
BYMONTH                            =   按月
BYDAY                              =   按天
IDC_ADV_MK_TITLE                   =   高級標刻參數
IDC_STATIC_PARLIB                  =   參數庫
IDS_MENU_OPER                      =   操作
IDC_STATIC_AUTOSAVE_DESC           =   每過指定時間間隔將當前數據保存到程序目錄下的AutoSave.orz文件中
IDS_INPUT_VALID_NUM                =   請輸入壹個10--1200之間的數

##Calibrate
IDD_DLG_CAL_LSM                    =   SeaThinking 振鏡校正
IDC_STATIC_CAL_PN                  =   校正點數:
IDC_STATIC_CAL_PD                  =   點距:
IDC_RESET                          =   重置
IDC_STA_AREA_SIZE                  =   區域尺寸
IDC_STA_AREA_SIZE2                 =   二次校正尺寸
IDC_MARK_CHECKED                   =   標刻校正圖形
IDC_MARK_CROSS                     =   標刻區域線
IDC_MARK_RECT                      =   標刻校正網格
IDC_SAVECOEF                       =   保存校正系數
IDC_OK                             =   關閉
IDC_CAL_HEADER_NO                  =   序號
IDC_CAL_HEADER_XCAL                =   X設定值
IDC_CAL_HEADER_YCAL                =   Y設定值
IDC_CAL_HEADER_XACT                =   X實測值
IDC_CAL_HEADER_YACT                =   Y實測值
MSG_CAL_TIP                        =   校正標刻已完成
MSG_CAL_NEEDSAVE                   =   請先保存校正系數

##IDR_MENU_RPOP
ID_RPOP_REPEAT_COMMAND             =  重復當前命令

IDC_STATIC_TXTANG                  =   文本角度
IDC_STATIC_STOP_SIG                =   停止信號被觸發，當前加工被停止!

##提示信息
[TIPS]
ID_FILE_NEW_57600                  =  新建(&N)\n建立新檔案\n新建
ID_FILE_OPEN_57601                 =  打開(&O)\n打開一個現有檔案\n打開
ID_FILE_CLOSE_57602                =  關閉\n關閉活動檔案\n關閉
ID_FILE_SAVE_57603                 =  儲存\n儲存活動檔案\n儲存
ID_FILE_SAVE_AS_57604              =  另存為\n將活動檔案以一個新檔案名儲存\n另存為
ID_FILE_PAGE_SETUP_57605           =  頁面設置\n改變列印選項\n頁面設置
ID_FILE_PRINT_SETUP_57606          =  列印設置\n改變列印機及列印選項\n列印設定
ID_FILE_PRINT_57607                =  列印\n列印活動檔案\n列印
ID_FILE_PRINT_PREVIEW_57609        =  列印預覽\n顯示整頁\n列印預覽

ID_EDIT_CLEAR_57632                =  刪除\n刪除被選對象\n刪除
ID_EDIT_CLEAR_ALL_57633            =  全部刪除\n全部刪除\n全部刪除
ID_EDIT_COPY_57634                 =  複製\n複製被選對象並將其置於剪貼板上\n複製
ID_EDIT_CUT_57635                  =  剪切\n剪切被選對象並將其置於剪貼板上\n剪下
ID_EDIT_FIND_57636                 =  查找\n查找指定的正文\n查找
ID_EDIT_PASTE_57637                =  黏貼\n插入剪貼板內容\n黏貼
ID_EDIT_REPEAT_57640               =  重複\n重複上一步操作\n重復
ID_EDIT_REPLACE_57641              =  替換\n用不同的正文替換指定的正文\n替換
ID_EDIT_SELECT_ALL_57642           =  選擇全部\n選擇全部圖形對象\n選擇全部
ID_EDIT_UNDO_57643                 =  撤消\n撤消最後壹步操作\n撤消
ID_EDIT_REDO_57644                 =  重新執行\n重新執行先前已撤消的操作\n重新執行

ID_ZOOM_WNDZOOM_32808              =  窗口縮放\n窗口縮放\n窗口縮放
ID_ZOOM_MOVE_32809                 =  平移\n平移圖紙\n平移
ID_ZOOM_ZOOMIN_32810               =  放大\n放大壹倍顯示\n放大
ID_ZOOM_ZOOMOUT_32811              =  縮小\n視圖縮小壹倍\n縮小
ID_ZOOM_VIEWALL_32812              =  全部觀察\n最大視圖觀察,所有對象\n全部觀察
ID_ZOOM_VIEWSELECTED_32813         =  選取觀察\n最大視圖觀察,所選取對象\n選取觀察
ID_ZOOM_VIEWPLACE_32814            =  查看工作區\n查看工作區\n工作區域觀察

ID_TOOL_PICK_32787                 =  圖形拾取\n圖形拾取\n圖形拾取
ID_TOOL_ITEMEDIT_32788             =  編輯節點\n編輯圖形節點\n編輯圖形節點
ID_TOOL_LINE_32789                 =  繪制直線\n繪制直線\n繪制直線
ID_TOOL_CURVE_32790                =  繪制曲線\n繪制曲線\n繪制曲線
ID_TOOL_RECTANGLE_32791            =  繪制矩形\n繪制矩形\n繪制矩形
ID_FILL_SHAPE_32796                =  填充\n填充被選取的對象\n填充                     
ID_TOOL_CIRCLE_32799               =  繪制圓\n繪制圓\n繪制圓
ID_TOOL_ELLIPSE_32800              =  繪制橢圓\n繪制橢圓\n繪制橢圓
ID_TOOL_POLYGON_32801              =  繪制多邊形\n繪制多邊形\n繪制多邊形
ID_TOOL_FONT_32802                 =  繪制文字\n繪制文字\n繪制文字
ID_TOOL_VECTORS_32804              =  矢量文件\n繪制矢量文件\n繪制矢量文件
ID_TOOL_BARCODE_32805              =  繪制條形碼\n繪制條形碼\n繪制條形碼
ID_TOOL_TIMER_32806                =  繪制延時器\n繪制延時器\n繪制延時器
ID_TOOL_INPORT_32807               =  繪制輸入口\n繪制輸入口\n繪制輸入口
ID_TOOL_BMP_32815                  =  圖片文件\n繪制圖片文件\n繪制圖片文件
ID_TOOL_OUTPORT_32816              =  繪制輸出口\n繪制輸出口\n繪制輸出口

ID_GROUP_SHAPE_32862               =  群組\n群組被選取的對象\n群組
ID_UNGROUP_SHAPE_32863             =  解散群組\n解散被選取的群組對象\n解散群組
ID_COMBINE_SHAPE_32864             =  組合\n組合被選取的對象\n組合
ID_UNCOMBINE_SHAPE_32865           =  分離組合\n分離被選取的組合對象\n分離組合

ID_FILE_SYSPARAM_32970             =  系統參數\n配置系統參數\n系統參數

ID_EDIT_SORT_32899                 =  排序\n將選中的多個圖形進行路徑優化\n排序

IDC_ALIGN_CENTER_32843             = 中心點對齊\n中心點對齊\n中心點對齊
IDC_ALIGN_LEFT_32837               = 左對齊\n左對齊\n左對齊
IDC_ALIGN_RIGHT_32838              = 右對齊\n右對齊\n右對齊
IDC_ALIGN_TOP_32840                = 上對齊\n上對齊\n上對齊
IDC_ALIGN_BOTTOM_32841             = 下對齊\n下對齊\n下對齊
IDC_ALIGN_CENTER_Y_32839           = 居中垂直對齊\n居中垂直對齊\n居中垂直對齊
IDC_ALIGN_CENTER_X_32842           = 居中水平對齊\n居中水平對齊\n居中水平對齊

IDC_LOCK_SHAPE_32844               = 鎖定所選對象\n鎖定所選對象\n鎖定所選對象
IDC_UNLOCK_SHAPE_32847             = 解鎖所選對象\n解鎖所選對象\n解鎖所選對象
IDC_UNLOCK_ALLSHAPE_32848          = 解鎖全部對象\n解鎖全部對象\n解鎖全部對象
IDC_MOVESHAPE_CENTER_32849         = 放置圖形於原點\n放置圖形於原點\n放置圖形於原點
IDC_SEL_BY_PEN_32850               = 按筆號選擇\n按筆號選擇圖形\n按筆號選擇
IDC_MIRROR_X_32853                 = X鏡像\n水平鏡像\nX鏡像
IDC_MIRROR_Y_32854                 = Y鏡像\n垂直鏡像\nY鏡像
IDC_GRAPH_PATH_32851               = 顯示路徑\n顯示或隱藏路徑\n顯示或隱藏路徑方向
ID_VIEW_ARROW_32875                = 顯示路徑\n顯示或隱藏路徑\n顯示或隱藏路徑方向

ID_LASER_ROC2_32971                = 360度旋轉標刻\n360度旋轉標刻\n360度旋角度轉標刻
ID_LASER_ROT_CFG_40017             = 旋轉配置與檢查\n旋轉配置\n旋轉參數配置與旋轉軸檢查

IDM_LSM_CALIB_40008                = 擬合檢定\n擬合檢定\n擬合檢定

ID_VIEW_TOOLBAR_59392              = 顯示或隱藏系統工具欄\n顯示或隱藏系統工具欄\n顯示或隱藏系統工具欄
IDR_TOOLBAR_DRAW_139                = 顯示或隱藏繪圖工具欄\n顯示或隱藏繪圖工具欄\n顯示或隱藏繪圖工具欄
ID_VIEW_STATUS_BAR_59393           = 顯示或隱藏狀態欄\n顯示或隱藏狀態欄\n顯示或隱藏狀態欄
IDS_READY_352                      = 就緒\n就緒\n就緒
IDR_TOOLBAR_ASSISTANT_188          = 輔助工具欄。圖形鎖定、解鎖，置於原點等\n輔助工具欄。圖形鎖定、解鎖，置於原點等\n輔助工具欄。圖形鎖定、解鎖，置於原點等
IDR_TOOLBAR_ALIGN_190              = 顯示或隱藏對齊工具欄\n顯示或隱藏對齊工具欄\n顯示或隱藏對齊工具欄
ID_VIEW_RESIZABLEBAR_LIST_32825    = 顯示或隱藏對象列表欄\n顯示或隱藏對象列表欄\n顯示或隱藏對象列表欄
ID_VIEW_RESIZABLEBAR_OBJPROP_32780 = 顯示或隱藏對象屬性欄\n顯示或隱藏對象屬性欄\n顯示或隱藏對象屬性欄
ID_VIEW_RESIZABLEBAR_MARKVALUE_32781 = 顯示或隱藏標刻參數欄\n顯示或隱藏標刻參數欄\n顯示或隱藏標刻參數欄
ID_LOCK_EDGE_40022                   = 鎖定側邊欄\n鎖定側邊欄\n鎖定側邊欄
ID_SNAP_GRID_32869                   = 開啟/關閉捕捉網格點\n開啟/關閉捕捉網格點\n開啟/關閉捕捉網格點
ID_SNAP_GUIDELINE_32916              = 開啟/關閉捕捉輔助線\n開啟/關閉捕捉輔助線\n開啟/關閉捕捉輔助線
ID_SNAP_OBJECT_32868                 = 開啟/關閉捕捉對象\n開啟/關閉捕捉對象\n開啟/關閉捕捉對象
ID_PREIVEW_PATH_32833                = 按次序顯示圖形的標刻軌跡\n軌跡預覽\n軌跡預覽
ID_IO_STATE_32981                    = IO狀態\nIO狀態\nIO狀態
ID_MENUITEM_BUILD_GCODE_32892        = 生成標刻腳本GCode\n生成GCode\n生成GCode
IDR_TOOLBAR_ZOOM_141                 = 顯示或隱藏放縮工具欄\n顯示或隱藏放縮工具欄\n顯示或隱藏放縮工具欄

[Others]
##
IDS_PORT_DEF_MKPORT                = 該輸入端口在開始標刻輸入口已定義
IDS_PORT_DEF_RDPORT                = 該輸入端口在紅光輸入口已定義
IDS_DEF_CONFLICT_PORT_OUT          = 輸出端口定義沖突，請檢查
IDS_DEF_CONFLICT_PORT_IN           = 輸入端口定義沖突，請檢查
##
IDS_VAR_ADV                        = 高級
IDC_CHK_ENA_SPLIT                  = 使能分割字符串修改指定名稱的文本對象
IDC_CHK_MKSELF                     = 標刻自己
IDC_CHK_FIXLEN                     = 使能固定文本寬度
IDC_BTN_ADD                        = 增加
IDC_BTN_ADVDEL                     = 刪除
IDC_BTN_ADVMOD                     = 修改
##
IDS_VAR_ADV_PARA                   = 參數
IDC_STATIC_FIRSTPOS                = 在字符串中第壹個字符的位置
IDC_STATIC_GETNUM                  = 從字符串中提取的字符總個數
IDC_STATIC_GETNUM2                 = 想要修改字符內容的文本對象名稱
##
IDS_FPGA_HD_INFO                   = 板卡信息
IDC_STATIC_CD_VER                  = 版本信息
IDC_CHK_HIG_THRIG                  = 高電平觸發
##
IDC_STATIC_JMQ                     = 計米器(m)
IDC_CHECK_INSIDE                   = 文本位於圓弧內側
##
OPEN_VECTOR_FILE_FAIL              = 不支持的向量文件格式
IDS_SUP_RANGE                      = 坐標超過振鏡範圍
##
IDS_SOFT_TRIAL_VER                 = 軟件為試用版本,請盡快聯系供應商獲得註冊碼!
IDS_SOFT_EXPIRE                    = 軟件已過試用期,軟件將在稍後退出,請聯系軟件供應商!
IDS_MENU_REG                       = 軟件註冊
##
IDS_DLG_REG_TITLE                  = 軟件註冊
IDC_STATIC_CODE                    = 機器碼
IDC_STATIC_IN_SERI                 = 輸入註冊碼
IDC_STATIC_HAS_REG                 = 軟件已註冊
##
IDS_MENU_HELP_DOC                  = 幫助文檔
IDS_DLG_INPORT_MARK                = 輸入端口打標
IDS_REG_CODE_HASREG                = 註冊碼已註冊
##
IDS_LOCK_SIDE                      = 鎖定側邊欄
IDS_CARD_ID_EMPTY                  = 板卡ID為空!
IDS_INVAL_SUP_CODE                 = 無效的註冊碼,供應商信息不對
IDS_REG_SUC                        = 註冊成功
IDS_CARD_INVALID                   = 沒有找到板卡
IDC_CHK_SUPSLEN                    = 使能超長打標
IDC_STATIC_SPLSIZE                 = 分割尺寸
IDC_STATIC_OFFSET                  = 補償間距]
IDS_INVAL_CODE                     = 無效的註冊碼
##
IDS_QR_CODE_MATRIX                 = 默認|版本1(21*21)|版本2(25*25)|版本3(29*29)|版本4(33*33)|版本5(37*37)|版本6(41*41)|版本7(45*45)|版本8(49*49)|版本9(53*53)|版本10(57*57)|版本11(61*61)
IDS_HANXIN_MATRIX                  = 默認|版本1(23*23)|版本2(25*25)|版本3(27*27)|版本4(29*29)|版本5(31*31)|版本6(33*33)|版本7(35*35)|版本8(37*37)|版本9(39*39)|版本10(41*41)|版本11(43*43)
IDC_STATIC_LEVEL                   = 糾錯級別
IDC_STATIC_MATRIX                  = 矩陣
##
IDC_FILE_TXT                       = TXT
IDC_FILE_EXCEL                     = EXCEL
IDC_FILE_NAME                      = 文件名稱
IDC_FILE_LIST                      = 字段名稱
##
IDC_CHK_LEAK                       = 漏光處理
IDC_CHK_UPDATE                     = 寫打標狀態到數據庫
##
IDS_PWD_SPACE                      = 密碼中請勿包括空格鍵
##
MENU_LAS_FILESMARK                 = 多文件標刻
MENU_ALIGN_EQUAL_HOR               = 圖像水平等距
MENU_ALIGN_EQUAL_VER               = 圖像垂直等距
##
IDC_STA_RING_COMP_DEC                      = 減速比
IDC_STATIC_BWKFRE                  = 電機啟動速度
IDS_FONT_VERM                      = 字符迎著打
IDC_STATIC_MKRES                   = 限制次數
IDC_STATIC_MKRES2                  = 提示信息
##
MENU_LAS_MOVEMARK                  = 移動標刻
IDC_STATIC_MOVEMARK                = 打標方案
IDC_BUTTON_AXIS_PARAM              = 擴展軸參數
IDC_BTN_MOVE_PARAM                 = 移動參數
IDC_BUTTON_RUN                     = 運行
IDC_STATIC_DISTANCE                = 移動距離
IDC_STATIC_RUNING                  = 當前操作
IDC_STATIC_CANMARK                 = 打標方式
IDC_STATIC_TIMES                   = 打標次數
IDC_RADIO_ALIGN_UP                 = 上
IDC_RADIO_ALIGN_DOWN               = 下
IDC_CMB_STATIC_MARK                = 靜止打標
IDC_CMB_CANNOT_MARK                = 不打標
IDC_BUTTON_SAVEMARK                = 保存方案
IDC_BUTTON_DELMARK                 = 刪除方案
IDC_CHK_MONITOR_PORTS              = 使用復合端口
IDC_STATIC_MOVEMACHINE             = 移動平臺
IDC_STATIC_MOVETEST                = 移動測試
IDC_STATIC_TIMESTEP                = 使用時間
IDC_STATIC_RETURNWAY               = 原路返回
IDC_STATIC_BACKZERO                = 循環打標
IDC_STATIC_SETCD                   = 坐標設置
IDC_STATIC_LINELONG                = 邊長
IDC_STATIC_ZERO                    = 原點
IDC_STATIC_START                   = 起始點
IDC_STATIC_NOW                     = 當前點
IDC_STATIC_TARGET                  = 目標點
IDC_CMB_RETRUNSTART                = 回起始點
IDC_CMB_GOTOTARGET                 = 到目標點
IDC_STATIC_UNITDISTANCE            = 單位距離
IDC_STATIC_UNITTIME                = 單位時間
IDC_CMB_RESETPIC                   = 刷新
IDC_MEG_GONO                       = 是否繼續?
IDC_MEG_OUTLOOPS                   = 目標點超出邊界!
IDC_MEG_RETRUNSTART                = 當前點不是起始點,是否移動回起始點?
IDS_MOVING                         = 正在移動
IDS_MOVE_FINISH                    = 移動結束
IDC_STATIC_MARKTIMES               = 完成方案次數
IDC_STATIC_MOVEGALVA               = 移動振鏡
IDC_STATIC_MOVEDEVICE              = 移動設備
MENU_LAS_CUTMARK                   = 分割標刻
MENU_LAS_CUTNUM                    = 分割數
IDC_STATIC_LPMM                    = 打標密度(點/毫米)
##
IDS_MAINFRMTIP                     = 八思量打標軟件
IDC_STATIC_USETIME                 = 離軟件使用結束還有%d天
IDS_SYSTEM_TIME_FAIL               = 最新的系統時間與板卡時間不壹致,請正確設置系統時間或聯系供應商
IDS_SOFT_NOT_USE                   = 軟件即將過期，請盡快註冊。
##
IDS_USB_COMM_ERROR                 = USB通訊錯誤
##
IDC_STATIC_FAULT                   = 移動誤差
IDC_STATIC_MOVEDIR                 = 移動方向
##
IDC_STATIC_MKLIMIT                 = 打標次數限制
IDC_CHK_GENDIS                     = 非常用參數使能編輯
IDC_CHK_REDPORTCNT                 = 使能端口紅光打標 
IDS_SELECT_FILEOUT                 = 文件未指定
IDS_TEXT_HAS_MARKED                = 已標刻過
IDC_CHK_SWITCH_TRIG                = 端口觸發打標
##
IDD_TXT_SAVEOUT                    = 輸出文本
IDC_CHK_OUT_TXT                    = 加工時輸出文本到指定文件
IDC_CHK_OUT_TIME                   = 加工時輸出時間到指定文件
IDC_CHK_MARK_FLAG                  = 檢查文本是否被標刻過
IDC_STATIC_FILE_OUT                = 文件名稱
##
IDS_SET_G_UNIT                     = 單位
IDC_STATIC_PATTERN_RANGE           = 圖案範圍
IDC_STATIC_FAULT2                  = 錯位誤差
IDS_OFFLINE_MARK                   = 離線打標中...
##
IDC_CHECK_FIXED                    = 固定分割
IDS_CURVE_DRAW                     = 曲線繪制
IDS_REC_DRAW                       = 矩形繪制
IDS_CIRCLE_DRAW                    = 繪制圓
IDS_ECLLI_DRAW                     = 繪制橢圓
IDS_POLY_DRAW                      = 繪制多邊形
IDS_INPORT_DRAW                    = 繪制輸入端口
IDS_OUTPORT_DRAW                   = 繪制輸出端口
IDS_SORT_DRAW                      = 排序
IDS_TEXT_DRAW                      = 繪制文字
IDS_TBARCODE_DRAW                  = 繪制條形碼
IDS_ENCODEDIT_DRAW                 = 繪制編碼器移動距離
IDS_DELAY_DRAW                     = 繪制延時器
IDS_POINT_DRAW                     = 繪制點
IDS_LINERIT_DRAW                   = 直線輸入(可右鍵輸入坐標)
##
IDC_STATIC_TIP_KEY                 = 提示
IDS_KEYBD_INPUT                    = 請輸入要加工的文本
IDC_CHK_FIXTXT                     = 固定字符數
IDC_CHK_KEY_SET                    = 設置筆參數
IDC_CHECK_FIXED                    = 固定分割
##
IDC_STATIC_MINDOTTIME              = 深度
##
IDC_STATIC_STARTPARAM              = 請認真確認右側參數設置與打標材料是否符合！
ID_DRAW_EXTAXI                     = 擴展軸
IDS_PUL_PERUNIT                    = 脈沖/毫米
IDS_PUL_PERDEG                     = 脈沖/度
IDS_EXT_AXI1                       = 擴展軸1
IDS_EXT_AXI2                       = 擴展軸2
IDC_CHK_ZERO                       = 擴展軸校正零點
IDC_CHK_EXTREL                     = 相對位置
IDC_STATIC_MOVE                    = 移動
IDC_BTN_EXT                        = 擴展
IDC_STATIC_UNITTYPE2               = 每單位脈沖數
IDS_EXT_AXI_BKZERO                 = 擴展軸回零中...
IDS_BKZERO_TIMEOUT                 = 回零超時
IDC_STATIC_FV                      = 流水線速度(cm/s)
IDC_CHK_SWITCH                     = 顯示預覽
##
IDC_PTMATRIC                       = 點陣字體
IDS_BSL_MATRICFONT                 = SEA  DOT MATRIC
IDC_CHK_CENTER                     = 放置到中心
IDC_CHECK_INVERT_PIC               = 反轉
ID_ROTMVMARK                       = 旋轉標刻
IDS_2D_PTMODE                      = 點模式
